Revit 2027 API
StairsLanding.IsAutomaticLanding Property
 True if the landing is an automatic landing, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAutomaticLanding { get; }
Public ReadOnly Property IsAutomaticLanding As Boolean
	Get
public:
property bool IsAutomaticLanding {
	bool get ();
}
member IsAutomaticLanding : bool with get
Property Value
Boolean
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace